KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32F479.svd
          <register>
            <name>DSI_ISR0</name>
            <displayName>DSI_ISR0</displayName>
            <description>DSI Host interrupt and status register 0</description>
            <addressOffset>0x00BC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AE0</name>
                <description>Acknowledge error 0
This bit retrieves the SoT error from the acknowledge error report.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE1</name>
                <description>Acknowledge error 1
This bit retrieves the SoT sync error from the acknowledge error report.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE2</name>
                <description>Acknowledge error 2
This bit retrieves the EoT sync error from the acknowledge error report.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE3</name>
                <description>Acknowledge error 3
This bit retrieves the escape mode entry command error from the acknowledge error report.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE4</name>
                <description>Acknowledge error 4
This bit retrieves the LP transmit sync error from the acknowledge error report.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE5</name>
                <description>Acknowledge error 5
This bit retrieves the peripheral timeout error from the acknowledge error report.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE6</name>
                <description>Acknowledge error 6
This bit retrieves the false control error from the acknowledge error report.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE7</name>
                <description>Acknowledge error 7
This bit retrieves the reserved (specific to the device) from the acknowledge error report.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE8</name>
                <description>Acknowledge error 8
This bit retrieves the ECC error, single-bit (detected and corrected) from the acknowledge error report.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE9</name>
                <description>Acknowledge error 9
This bit retrieves the ECC error, multi-bit (detected, not corrected) from the acknowledge error report.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE10</name>
                <description>Acknowledge error 10
This bit retrieves the checksum error (long packet only) from the acknowledge error report.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE11</name>
                <description>Acknowledge error 11
This bit retrieves the not recognized DSI data type from the acknowledge error report.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE12</name>
                <description>Acknowledge error 12
This bit retrieves the DSI VC ID Invalid from the acknowledge error report.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE13</name>
                <description>Acknowledge error 13
This bit retrieves the invalid transmission length from the acknowledge error report.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE14</name>
                <description>Acknowledge error 14
This bit retrieves the reserved (specific to the device) from the acknowledge error report.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>AE15</name>
                <description>Acknowledge error 15
This bit retrieves the DSI protocol violation from the acknowledge error report.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE0</name>
                <description>PHY error 0
This bit indicates the ErrEsc escape entry error from lane 0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE1</name>
                <description>PHY error 1
This bit indicates the ErrSyncEsc low-power transmission synchronization error from lane 0.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE2</name>
                <description>PHY error 2
This bit indicates the ErrControl error from lane 0.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE3</name>
                <description>PHY error 3
This bit indicates the LP0 contention error ErrContentionLP0 from lane 0.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PE4</name>
                <description>PHY error 4
This bit indicates the LP1 contention error ErrContentionLP1 from lane 0.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_ISR1</name>
            <displayName>DSI_ISR1</displayName>
            <description>DSI Host interrupt and status register 1</description>
            <addressOffset>0x00C0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TOHSTX</name>
                <description>Timeout high-speed transmission
This bit indicates that the high-speed transmission timeout counter reached the end and contention is detected.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TOLPRX</name>
                <description>Timeout low-power reception
This bit indicates that the low-power reception timeout counter reached the end and contention is detected.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ECCSE</name>
                <description>ECC single-bit error
This bit indicates that the ECC single error is detected and corrected in a received packet.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ECCME</name>
                <description>ECC multi-bit error
This bit indicates that the ECC multiple error is detected in a received packet.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CRCE</name>
                <description>CRC error
This bit indicates that the CRC error is detected in the received packet payload.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PSE</name>
                <description>Packet size error
This bit indicates that the packet size error is detected during the packet reception.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EOTPE</name>
                <description>EoTp error
This bit indicates that the EoTp packet is not received at the end of the incoming peripheral transmission.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>LPWRE</name>
                <description>LTDC payload write error
This bit indicates that during a DPI pixel line storage, the payload FIFO becomes full and the data stored is corrupted.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GCWRE</name>
                <description>Generic command write error
This bit indicates that the system tried to write a command through the generic interface and the FIFO is full. Therefore, the command is not written.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GPWRE</name>
                <description>Generic payload write error
This bit indicates that the system tried to write a payload data through the generic interface and the FIFO is full. Therefore, the payload is not written.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GPTXE</name>
                <description>Generic payload transmit error
This bit indicates that during a generic interface packet build, the payload FIFO becomes empty and corrupt data is sent.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GPRDE</name>
                <description>Generic payload read error
This bit indicates that during a DCS read data, the payload FIFO becomes empty and the data sent to the interface is corrupted.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>GPRXE</name>
                <description>Generic payload receive error
This bit indicates that during a generic interface packet read back, the payload FIFO becomes full and the received data is corrupted.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
