KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32F479.svd
          <register>
            <name>DSI_WPCR0</name>
            <displayName>DSI_WPCR0</displayName>
            <description>DSI Wrapper PHY configuration register 0</description>
            <addressOffset>0x0418</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>UIX4</name>
                <description>Unit interval multiplied by 4
This field defines the bit period in high-speed mode in unit of 0.25 ns.
As an example, if the unit interval is 3 ns, a value of twelve (0x0C) must be driven to this input. This value is used to generate delays. If the period is not a multiple of 0.25 ns, the value driven must be rounded down. For example, a 600 Mbit/s link uses a unit interval of 1.667 ns, which, multiplied by four gives 6.667 ns. In this case a value of 6 (not 7) must be driven onto the ui_x4 input.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SWCL</name>
                <description>Swap clock lane pins
This bit swaps the pins on clock lane.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Regular clock lane pin configuration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Swapped clock lane pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWDL0</name>
                <description>Swap data lane 0 pins
This bit swaps the pins on data lane 0.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Regular clock lane pin configuration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Swapped clock lane pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWDL1</name>
                <description>Swap data lane 1 pins
This bit swaps the pins on clock lane.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Regular clock lane pin configuration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Swapped clock lane pin</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSICL</name>
                <description>Invert high-speed data signal on clock lane
This bit inverts the high-speed data signal on clock lane.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Normal data configuration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Inverted data configuration</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIDL0</name>
                <description>Invert the high-speed data signal on data lane 0
This bit inverts the high-speed data signal on clock lane.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Normal data signal configuration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Inverted data signal configuration</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSIDL1</name>
                <description>Invert the high-speed data signal on data lane 1
This bit inverts the high-speed data signal on data lane 1.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Normal data signal configuration</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Inverted data signal configuration</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FTXSMCL</name>
                <description>Force in TX Stop mode the clock lane
This bit forces the clock lane in TX stop mode. It is used to initialize a lane module in transmit mode. It causes the lane module to immediately jump to transmit control mode and to begin transmitting a stop state (LP-11). It can be used to go back in TX mode after a wrong BTA sequence.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Force the clock lane in TX Stop mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FTXSMDL</name>
                <description>Force in TX Stop mode the data lanes
This bit forces the data lanes in TX stop mode. It is used to initialize a lane module in transmit mode. It causes the lane module to immediately jump to transmit control mode and to begin transmitting a stop state (LP-11). It can be used to go back in TX mode after a wrong BTA sequence.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Force the data lanes in TX Stop mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CDOFFDL</name>
                <description>Contention detection OFF on data lanes
When only forward escape mode is used, this signal can be made high to switch off the contention detector and reduce static power consumption.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Contention detection on data lane ON</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Contention detection on data lane OFF</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TDDL</name>
                <description>Turn disable data lanes
This bit forces the data lane to remain in RX event if it receives a bus-turn-around request from the other side.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Force data lanes in RX mode after a BTA</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PDEN</name>
                <description>Pull-down enable
This bit enables a pull-down on the lane to prevent from floating states when unused.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Pull-down on lanes disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Pull-down on lanes enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCLKPREPEN</name>
                <description>Custom time for t&lt;sub&gt;CLK-PREPARE&lt;/sub&gt; enable
This bit enables the manual programming of t&lt;sub&gt;CLK-PREPARE &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the TLKCPREP field of the DSI_WPCR2 register.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;CLK-PREPARE&lt;/sub&gt;</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;CLK-PREPARE&lt;/sub&gt;</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCLKZEROEN</name>
                <description>Custom time for t&lt;sub&gt;CLK-ZERO&lt;/sub&gt; enable
This bit enables the manual programming of t&lt;sub&gt;CLK-ZERO &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the TCLKZERO field of the DSI_WPCR2 register.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;CLK-ZERO&lt;/sub&gt;.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;CLK-ZERO&lt;/sub&gt;.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>THSPREPEN</name>
                <description>Custom time for t&lt;sub&gt;HS-PREPARE&lt;/sub&gt; enable
This bit enables the manual programming of t&lt;sub&gt;HS-PREPARE &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the THSPREP field of the DSI_WPCR2 register.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;HS-PREPARE&lt;/sub&gt;.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;HS-PREPARE&lt;/sub&gt;.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>THSTRAILEN</name>
                <description>Custom time for t&lt;sub&gt;HS-TRAIL&lt;/sub&gt; enable
This bit enables the manual programming of T&lt;sub&gt;HS-TRAIL &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the THSRAIL field of the DSI_WPCR2 register.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for T&lt;sub&gt;HS-TRAIL&lt;/sub&gt;.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for T&lt;sub&gt;HS-TRAIL&lt;/sub&gt;.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>THSZEROEN</name>
                <description>Custom time for t&lt;sub&gt;HS-ZERO&lt;/sub&gt; enable
This bit enables the manual programming of t&lt;sub&gt;HS-ZERO &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the THSZERO field of the DSI_WPCR3 register.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;HS-ZERO&lt;/sub&gt;.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;HS-ZERO&lt;/sub&gt;.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TLPXDEN</name>
                <description>Custom time for t&lt;sub&gt;LPX&lt;/sub&gt; for data lanes enable
This bit enables the manual programming of T&lt;sub&gt;LPX &lt;/sub&gt;duration for the data lanes in the D-PHY. The desired value must be programmed in the TLPXD field of the DSI_WPCR3 register.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for T&lt;sub&gt;LPX&lt;/sub&gt; for the data lanes.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for T&lt;sub&gt;LPX&lt;/sub&gt; for the data lanes.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>THSEXITEN</name>
                <description>Custom time for t&lt;sub&gt;HS-EXIT&lt;/sub&gt; enable
This bit enables the manual programming of t&lt;sub&gt;HS-EXIT &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the THSEXIT field of the DSI_WPCR3 register.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;HS-EXIT&lt;/sub&gt;.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;HS-EXIT&lt;/sub&gt;.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TLPXCEN</name>
                <description>Custom time for t&lt;sub&gt;LPX&lt;/sub&gt; for clock lane enable
This bit enables the manual programming of t&lt;sub&gt;LPX&lt;/sub&gt; duration for the clock lane in the D-PHY. The desired value must be programmed in the TLPXC field of the DSI_WPCR3 register.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;LPX&lt;/sub&gt; for the clock lane.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;LPX&lt;/sub&gt; for the clock lane.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCLKPOSTEN</name>
                <description>Custom time for t&lt;sub&gt;CLK-POST&lt;/sub&gt; enable
This bit enables the manual programming of t&lt;sub&gt;CLK-POST &lt;/sub&gt;duration in the D-PHY. The desired value must be programmed in the TCLKPOST field of the DSI_WPCR4 register.</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Default value is used for t&lt;sub&gt;CLKPOST&lt;/sub&gt;.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Programmable value is used for t&lt;sub&gt;CLKPOST&lt;/sub&gt;.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
