KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32F479.svd
          <register>
            <name>DSI_WPCR1</name>
            <displayName>DSI_WPCR1</displayName>
            <description>DSI Wrapper PHY configuration register 1</description>
            <addressOffset>0x041C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSTXDCL</name>
                <description>High-speed transmission delay on clock lane
Delay tuner control to change delay (up to DP/DN) in clock path. Can be used to change clock edge position with respect to data bit transitions on DP/DN.
Default value = 00.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HSTXDDL</name>
                <description>High-speed transmission delay on data lanes
Delay tuner control to change delay (up to DP/DN) in data path. Can be used to change data edge transition positions with respect to clock edge on DP/DN.
Default value = 00.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LPSRCCL</name>
                <description>Low-power transmission slew-rate compensation on clock lane
Can be used to change slew-rate of clock lane LP transitions.
Default value = 00.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LPSRCDL</name>
                <description>Low-power transmission slew-rate compensation on data lanes
Can be used to change slew-rate of data lane LP transitions.
Default value = 00.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SDDC</name>
                <description>SDD control
This bit switches on the additional current path to meet the SDDTx parameter defined by MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY Specification on both clock and data lanes.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Activate additional current path on all lanes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSTXSRCCL</name>
                <description>High-speed transmission slew-rate control on clock lane
Slew-rate control for high-speed transmitter output. It can be used to change slew-rate of clock lane HS transitions.
Default value = 00.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HSTXSRCDL</name>
                <description>High-speed transmission slew-rate control on data lanes
Slew-rate control for high-speed transmitter output. It can be used to change slew-rate of data lane HS transitions.
Default value = 00.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLPRXLPM</name>
                <description>Forces LP receiver in low-power mode
This bit enables the low-power mode of LP receiver (LPRX). When set, the LPRX
operates in low-power mode all the time (when this is not activated, LPRX operates in low power mode during ULPS only).</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>No effect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPRX is forced in low-power mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPRXFT</name>
                <description>Low-power RX low-pass filtering tuning
This signal can be used to tune the cutoff frequency of low-pass filter at the input of LPRX.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_WPCR2</name>
            <displayName>DSI_WPCR2</displayName>
            <description>DSI Wrapper PHY configuration register 2</description>
            <addressOffset>0x0420</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TCLKPREP</name>
                <description>t&lt;sub&gt;CLK-PREPARE&lt;/sub&gt;
This field defines the t&lt;sub&gt;CLK-PREPARE&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the TCLKPREPEN bit of the DSI_WPCR0 is set.
TCLKPREP = 2 x t&lt;sub&gt;CLK-PREPARE&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when TCLKPREPEN bit of the DSI_WPCR0 is reset is 120 (60ns + 20*UI).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TCLKZERO</name>
                <description>t&lt;sub&gt;CLK-ZERO&lt;/sub&gt;
This field defines the t&lt;sub&gt;CLK-ZERO&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the TCLKZEROEN bit of the DSI_WPCR0 is set.
TCLKZERO = t&lt;sub&gt;CLK-ZERO&lt;/sub&gt; / 2 expressed in ns.The default value used by the D-PHY when TCLKZEROEN bit of the DSI_WPCR0 is reset is 195 (390ns).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THSPREP</name>
                <description>t&lt;sub&gt;HS-PREPARE&lt;/sub&gt;
This field defines the t&lt;sub&gt;HS-PREPARE&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the THSPREPEN bit of the DSI_WPCR0 is set.
THSPREP = 2 x t&lt;sub&gt;HS-PREPARE&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when THSPREPEN bit of the DSI_WPCR0 is reset is 126 (63ns + 12*UI).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THSTRAIL</name>
                <description>t&lt;sub&gt;HSTRAIL&lt;/sub&gt;
This field defines the t&lt;sub&gt;HS-TRAIL&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the THSTRAILEN bit of the DSI_WPCR0 is set.
THSTRAIL = 2 x t&lt;sub&gt;HS-TRAIL&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when THSTRAILEN bit of the DSI_WPCR0 is reset is 140 (70ns+8*UI).</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_WPCR3</name>
            <displayName>DSI_WPCR3</displayName>
            <description>DSI Wrapper PHY configuration register 3</description>
            <addressOffset>0x0424</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>THSZERO</name>
                <description>t&lt;sub&gt;HS-ZERO&lt;/sub&gt;
This field defines the t&lt;sub&gt;HS-ZERO&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the THSZEROEN bit of the DSI_WPCR1 is set.
THSZERO = t&lt;sub&gt;HS-ZERO&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when THSZEROEN bit of the DSI_WPCR1 is reset is 175, (175ns).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TLPXD</name>
                <description>t&lt;sub&gt;LPX&lt;/sub&gt; for data lanes
This field defines the t&lt;sub&gt;LPX&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification for the data lanes. This value is used by the D-PHY when the TLPXDEN bit of the DSI_WPCR1 is set.
TLPXD = 2 x t&lt;sub&gt;LPX&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when TLPXDEN bit of the DSI_WPCR1 is reset is 100 (50ns).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THSEXIT</name>
                <description>t&lt;sub&gt;HSEXIT&lt;/sub&gt;
This field defines the t&lt;sub&gt;HS-EXHigh-SpeedIT&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the THSEXITEN bit of the DSI_WPCR1 is set.
THSEXIT = t&lt;sub&gt;HS-ZERO&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when THSEXITEN bit of the DSI_WPCR1 is reset is 100 (100ns).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TLPXC</name>
                <description>t&lt;sub&gt;LPXC&lt;/sub&gt; for clock lane
This field defines the t&lt;sub&gt;LPX&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification for the clock lane. This value is used by the D-PHY when the TLPXCEN bit of the DSI_WPCR1 is set.
TLPXC = 2 x t&lt;sub&gt;LPX&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when TLPXCEN bit of the DSI_WPCR1 is reset is 100 (50ns).</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_WPCR4</name>
            <displayName>DSI_WPCR4</displayName>
            <description>DSI Wrapper PHY configuration register 4</description>
            <addressOffset>0x0428</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TCLKPOST</name>
                <description>t&lt;sub&gt;CLK-POST&lt;/sub&gt;
This field defines the t&lt;sub&gt;CLK-POST&lt;/sub&gt; has specified in the MIPI&lt;sup&gt;&lt;/sup&gt; D-PHY specification. This value is used by the D-PHY when the TCLKPOSTEN bit of the DSI_WPCR0 is set.
TCLKPOST = 2 x t&lt;sub&gt;CLK-POST&lt;/sub&gt; expressed in ns.The default value used by the D-PHY when TCLKPOSTEN bit of the DSI_WPCR0 is reset is 200 (100ns + 120*UI).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSI_WRPCR</name>
            <displayName>DSI_WRPCR</displayName>
            <description>DSI Wrapper regulator and PLL control register</description>
            <addressOffset>0x0430</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PLLEN</name>
                <description>PLL enable
This bit enables the D-PHY PLL.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NDIV</name>
                <description>PLL loop division factor
This field configures the PLL loop division factor.
10 to 125: Allowed loop division factor values
Others: Reserved</description>
                <bitOffset>2</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IDF</name>
                <description>PLL input division factor
This field configures the PLL input division factor.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL input divided by 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL input divided by 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>PLL input divided by 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>PLL input divided by 3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4</name>
                    <description>PLL input divided by 4</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x5</name>
                    <description>PLL input divided by 5</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6</name>
                    <description>PLL input divided by 6</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7</name>
                    <description>PLL input divided by 7</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ODF</name>
                <description>PLL output division factor
This field configures the PLL output division factor.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>PLL output divided by 1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>PLL output divided by 2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>PLL output divided by 4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>PLL output divided by 8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REGEN</name>
                <description>Regulator enable
This bit enables the DPHY regulator.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>regulator disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>regulator enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
